In [34]:
import numpy as np
import pandas as pd

# PART A

Q1.

In [35]:
df = pd.DataFrame({'A': ['group1', 'group1', 'group2', 'group1','group2', 'group1', 'group2', 'group2','group2','group1'], 
                   'B': ['true', 'true', 'true', 'false', 'false', 'false', 'false', 'true','false','true']})

In [36]:
p=df['B'].groupby(df['A'])
list(p)
p.value_counts()

A       B
group1  true     3
        false    2
group2  false    3
        true     2
Name: B, dtype: int64

ans: group1 has more true values than false values

Q2

In [37]:
ser1 = pd.Series([1, 2, 3, 4, 5]) 
ser2 = pd.Series([4, 5, 6, 7, 8])
set1=set(ser1)
set2=set(ser2)

In [38]:
def find_uncommon_items(set1,set2):
  if(set1 ^ set2):
    print('uncommon items are:'+str(set1 ^ set2))
  else:
    print('common items')

find_uncommon_items(set1,set2)

uncommon items are:{1, 2, 3, 6, 7, 8}

In [39]:
def common_items(set1,set2):
  if(set1 & set2):
    print('common items are:'+str(set1 & set2))
  else:
    print('no common items')
common_items(set1,set2)

common items are:{4, 5}

Q3.

In [40]:
items =[1, 3, 6, 10, 15, 21, 27, 35]
p=pd.Series(items)
for i in range(0,8):
  if p[i]%3==0:
    print('the position of multiples of 3:',i)
    
print(p.diff().tolist())

the position of multiples of 3: 1
the position of multiples of 3: 2
the position of multiples of 3: 4
the position of multiples of 3: 5
the position of multiples of 3: 6
[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

# ------------------------------------------------------------------------------------------------------------

# PART B

In [41]:
df = pd.read_csv(r"C:\Users\KIIT\HRC Task\Assignments\GroupBy Assignment\Grouby_Assignment_Data.csv")
df.head(5)

,Unnamed: 0,Unnamed: 0.1,school_state,teacher_prefix,project_grade_category,teacher_number_of_previously_posted_projects,project_is_approved,project_subject_categories,project_subject_subcategories,price,quantity
0,0,0,in,mrs,grades_prek_2,0,0,literacy_language,esl_literacy,154.60,23
1,1,1,fl,mr,grades_6_8,7,1,history_civics_health_sports,civics_government_teamsports,299.00,1
2,2,2,az,ms,grades_6_8,1,0,health_sports,health_wellness_teamsports,516.85,22
3,3,3,ky,mrs,grades_prek_2,4,1,literacy_language_math_science,literacy_mathematics,232.90,4
4,4,4,tx,mrs,grades_prek_2,1,1,math_science,mathematics,67.98,4

Q1.

In [42]:
df.groupby("school_state")['price'].mean()

school_state
ak    337.510667
al    298.641397
ar    278.166613
az    252.355673
ca    323.282639
co    252.666940
ct    311.030415
dc    360.152267
de    234.136735
fl    297.499525
ga    308.207945
hi    365.838639
ia    284.773153
id    253.708874
il    284.538685
in    249.736221
ks    246.894763
ky    280.020031
la    358.954185
ma    328.623520
md    303.952794
me    274.640000
mi    299.793970
mn    249.289851
mo    276.094635
ms    306.512922
mt    278.000490
nc    254.037568
nd    256.985035
ne    286.515307
nh    330.994425
nj    336.891618
nm    297.836876
nv    283.005000
ny    335.973861
oh    271.301090
ok    264.163071
or    289.779098
pa    279.585613
ri    296.904035
sc    247.343586
sd    249.673433
tn    279.079419
tx    304.977799
ut    310.182139
va    267.539311
vt    289.467250
wa    283.266018
wi    301.433963
wv    258.633121
wy    307.638878
Name: price, dtype: float64

Q2.a

In [43]:
df.groupby("teacher_prefix")['teacher_number_of_previously_posted_projects'].count()

teacher_prefix
dr            13
mr         10645
mrs        57264
ms         38944
teacher     2360
Name: teacher_number_of_previously_posted_projects, dtype: int64

Q2.b

In [44]:
d=df.groupby("teacher_prefix")['teacher_number_of_previously_posted_projects'].count()
maxx=d[0]
for i in range(1,len(d)):
    if(d[i]>maxx):
        maxx=d[i]
        y=i
print(d.index[y])

mrs

Q3.

In [45]:
grades_9_12_group=df.groupby(['project_grade_category']).get_group('grades_9_12')
grades_9_12_group.groupby('project_subject_categories')['project_is_approved'].agg(np.sum)

project_subject_categories
appliedlearning                        384
appliedlearning_health_sports           34
appliedlearning_history_civics          57
appliedlearning_literacy_language      191
appliedlearning_math_science           142
appliedlearning_music_arts             139
appliedlearning_specialneeds            99
appliedlearning_warmth_care_hunger       1
health_sports                          940
health_sports_appliedlearning            6
health_sports_history_civics             7
health_sports_literacy_language         10
health_sports_math_science               8
health_sports_music_arts                16
health_sports_specialneeds              54
health_sports_warmth_care_hunger         2
history_civics                         449
history_civics_appliedlearning           6
history_civics_health_sports             6
history_civics_literacy_language        92
history_civics_math_science             16
history_civics_music_arts               50
history_civics_specialneeds             54
literacy_language                     1769
literacy_language_appliedlearning       19
literacy_language_health_sports          8
literacy_language_history_civics        50
literacy_language_math_science          72
literacy_language_music_arts           153
literacy_language_specialneeds         220
math_science                          1999
math_science_appliedlearning           146
math_science_health_sports              46
math_science_history_civics             31
math_science_literacy_language          71
math_science_music_arts                139
math_science_specialneeds              177
math_science_warmth_care_hunger          1
music_arts                             962
music_arts_appliedlearning               1
music_arts_health_sports                 4
music_arts_history_civics                1
music_arts_specialneeds                 16
specialneeds                           309
specialneeds_health_sports              16
specialneeds_music_arts                 38
specialneeds_warmth_care_hunger          4
warmth_care_hunger                     166
Name: project_is_approved, dtype: int64

Q4.

In [46]:
projects_sum = df.groupby('teacher_prefix')['project_is_approved'].agg('sum')
projects_count = df.groupby('teacher_prefix')['project_is_approved'].agg('count')
projects_avg=projects_sum/projects_count
df["teacher_prefix"].replace(list(projects_avg.index),list(projects_avg.values), inplace=True)
df

,Unnamed: 0,Unnamed: 0.1,school_state,teacher_prefix,project_grade_category,teacher_number_of_previously_posted_projects,project_is_approved,project_subject_categories,project_subject_subcategories,price,quantity
0,0,0,in,0.855546,grades_prek_2,0,0,literacy_language,esl_literacy,154.60,23
1,1,1,fl,0.841522,grades_6_8,7,1,history_civics_health_sports,civics_government_teamsports,299.00,1
2,2,2,az,0.843519,grades_6_8,1,0,health_sports,health_wellness_teamsports,516.85,22
3,3,3,ky,0.855546,grades_prek_2,4,1,literacy_language_math_science,literacy_mathematics,232.90,4
4,4,4,tx,0.855546,grades_prek_2,1,1,math_science,mathematics,67.98,4
...,...,...,...,...,...,...,...,...,...,...,...
109221,109221,109243,mo,0.841522,grades_prek_2,0,1,literacy_language_math_science,literature_writing_mathematics,59.98,8
109222,109222,109244,nj,0.843519,grades_prek_2,0,1,literacy_language_math_science,literacy_mathematics,846.32,4
109223,109223,109245,nj,0.855546,grades_prek_2,3,1,literacy_language_math_science,literacy_mathematics,239.96,4
109224,109224,109246,ny,0.855546,grades_3_5,0,1,health_sports_specialneeds,health_wellness_specialneeds,73.05,16
109225,109225,109247,va,0.843519,grades_6_8,0,1,appliedlearning_math_science,college_careerprep_mathematics,109.90,5

Q5.

In [47]:
data={'state':['A','B','C','A','A','B','A','A','C','C'],'class':[0,1,1,0,1,1,0,1,1,0]}
td=pd.DataFrame(data)
print(td)
hint=pd.DataFrame(td.groupby(['class','state']).agg('size'))
hint=hint.unstack().T
hint=hint.replace(np.nan, 0)
hint=pd.DataFrame(hint.astype(int))
print("\n",hint)
data={'state_0':['A','B','C','A','A','B','A','A','C','C'], 'state_1':['A','B','C','A','A','B','A','A','C','C']}
en_td=pd.DataFrame(data)
en_td['state_0']=en_td['state_0'].map({'A':str(hint.loc[0,'A'][0])+"/"+str(hint.loc[0,'A'][0]+hint.loc[0,'A'][1]),'B':str(hint.loc[0,'B'][0])+"/"+str(hint.loc[0,'B'][0]+hint.loc[0,'B'][1]), 'C':str(hint.loc[0,'C'][0])+"/"+str(hint.loc[0,'C'][0]+hint.loc[0,'C'][1])})
en_td['state_1']=en_td['state_1'].map({'A':str(hint.loc[0,'A'][1])+"/"+str(hint.loc[0,'A'][0]+hint.loc[0,'A'][1]),'B':str(hint.loc[0,'B'][1])+"/"+str(hint.loc[0,'B'][0]+hint.loc[0,'B'][1]), 'C':str(hint.loc[0,'C'][1])+"/"+str(hint.loc[0,'C'][0]+hint.loc[0,'C'][1])})
en_td

  state  class
0     A      0
1     B      1
2     C      1
3     A      0
4     A      1
5     B      1
6     A      0
7     A      1
8     C      1
9     C      0

 class    0  1
  state
0 A      3  2
  B      0  2
  C      1  2

  state_0 state_1
0     3/5     2/5
1     0/2     2/2
2     1/3     2/3
3     3/5     2/5
4     3/5     2/5
5     0/2     2/2
6     3/5     2/5
7     3/5     2/5
8     1/3     2/3
9     1/3     2/3